# step 1 : import the data packagaes

In [1]:
import numpy as np   # numbericalsL maths oprns
import pandas as pd  # tables and data frame operations
import matplotlib.pyplot as plt  # plotting
import seaborn as sns   # plotting

# step 2 : Create a dataframe using list

In [2]:
l1=['Mallesh','chinna','ameen']
l2=[34,2,456]
pd.DataFrame(l1,l2)

           0
34   Mallesh
2     chinna
456    ameen

- data=None,
    - index: 'Axes | None' = None,
    - columns: 'Axes | None' = None,
    - dtype: 'Dtype | None' = None,
    - copy: 'bool | None' = None

In [3]:
l1=['Mallesh','chinna','ameen']
l2=[34,2,456]
pd.DataFrame(zip(l1,l2))

         0    1
0  Mallesh   34
1   chinna    2
2    ameen  456


# step-3 : add the columns names

In [4]:
l1=['Mallesh','chinna','ameen']
l2=[34,2,456]
l3=[l1,l2]
pd.DataFrame(l3).T

         0    1
0  Mallesh   34
1   chinna    2
2    ameen  456

In [5]:
l1=['Mallesh','chinna','ameen']
l2=[34,2,456]
pd.DataFrame(zip(l1,l2),columns=['names','age'])

     names  age
0  Mallesh   34
1   chinna    2
2    ameen  456

In [6]:
l1=['Mallesh','chinna','ameen']
l2=[34,2,456]
cols=['Names','age','school']
pd.DataFrame(zip(l1,l2),cols)

              0    1
Names   Mallesh   34
age      chinna    2
school    ameen  456

In [7]:
l1=['Mallesh','chinna','ameen']
l2=[34,2,456]
cols=['Names','age']
pd.DataFrame(zip(l1,l2),columns=cols)

     Names  age
0  Mallesh   34
1   chinna    2
2    ameen  456

In [8]:
l1=['Mallesh','chinna','ameen']
l2=[34,2,456]
l3=[987654321,1234567890,98765432123456]
cols=['Names','age','phone number']
pd.DataFrame(zip(l1,l2,l3),index=['a','b','c'],columns=cols)

     Names  age    phone number
a  Mallesh   34       987654321
b   chinna    2      1234567890
c    ameen  456  98765432123456

In [9]:
# step-4 indexing

In [10]:
l1=['Mallesh','chinna','ameen']
l2=[34,2,456]
l3=[987654321,1234567890,98765432123456]
cols=['Names','age','phone number']
pd.DataFrame(zip(l1,l2,l3),index=['a','b','c'],columns=cols)

     Names  age    phone number
a  Mallesh   34       987654321
b   chinna    2      1234567890
c    ameen  456  98765432123456

In [11]:
# steep-5 create a empty dataframe and update the datafram e

In [12]:
df=pd.DataFrame()

In [13]:
df

Empty DataFrame
Columns: []
Index: []

In [14]:
df['names']=['ameen','niraj','abdul']

In [15]:
df['names']

0    ameen
1    niraj
2    abdul
Name: names, dtype: object

In [16]:
df['Names']

KeyError: 'Names'

In [ ]:
df

In [ ]:
df['age']=[12,123,1234]

In [ ]:
df['age']

In [ ]:
df

In [ ]:
df['city']=['hyderabad','cheeennaii','kashmir']
df['city']

In [ ]:

df

In [ ]:
df['Age'] = [23,4,56789]

In [ ]:
df

In [ ]:
df

#  drop the column

In [ ]:
df.drop()

- labels: 'IndexLabel | None' = None,
    -  *,
    - axis: 'Axis' = 0,
    - index: 'IndexLabel | None' = None,
    - columns: 'IndexLabel | None' = None,
    - level: 'Level | None' = None,
    - inplace: 'bool' = False,
    - errors: 'IgnoreRaise' = 'raise',
) -> 'DataFrame | None

In [ ]:
df.drop(2, axis=0)  # works on row

In [ ]:
df

In [ ]:
df.drop([1,2])

In [ ]:
df

In [ ]:
df.drop('age',axis=1)  # works on columns

In [ ]:
df

In [ ]:
df.drop(['Age','city'],axis=1)

In [ ]:
df

In [ ]:
df.drop(index=2)

In [ ]:
df.drop(index=0)

In [ ]:
df.drop(columns='Age')

In [ ]:
df.drop('Age',axis=1, inplace=True)

In [ ]:
df

In [ ]:
df

In [ ]:
df

In [ ]:
df.columns(['names','age'], object)

In [18]:
a=10
b=20
c=a+b
c

30